# FluidTemperature Class

---
Represents the dynamic viscosity and density properties as defined at a certain temperature.
SystemObject Autodesk.Revit.DB.PlumbingFluidTemperature
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FluidTemperature : IDisposable

    Public Class FluidTemperature
    	Implements IDisposable

    public ref class FluidTemperature : IDisposable

    type FluidTemperature =
        class
            interface IDisposable
        end
The FluidTemperature type exposes the following members.
| Name| Description
---|---|---
| FluidTemperature|  Creates a new fluid temperature with given temperature, dynamic viscosity and density.
Top
| Name| Description
---|---|---
| Density|  The density value
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Temperature|  The temperature value
| Viscosity|  The dynamic viscosity value
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the FluidTemperature
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Plumbing Namespace